[
    {
      "Id": 1,
      "img": "https://i.ibb.co/f8ZLsrR/Rectangle-2-2.png",
      "title": "Introduction to C Programming",
      "credit": 15,
      "prices": 25,
      "description": "C Programming is a foundational programming language. Used for system software, games, and applications. Offers great control and efficiency."
    },
    {
      "Id": 2,
      "img": "https://i.ibb.co/Th01cgc/Rectangle-2-3.png",
      "title": "Introduction to Algorithms",
      "credit": 8,
      "prices": 12,
      "description": "Algorithms: Step-by-step procedures for problem-solving. Essential in computer science for efficient data processing, search, and problem-solving tasks."
    },
    {
      "Id": 3,
      "img": "https://i.ibb.co/PW2fmCv/Rectangle-2-4.png",
      "title": "Introduction to C++ for DSA",
      "credit": 8,
      "prices": 35,
      "description": "Explore the C++ programming language in the context of Data Structures and Algorithms, essential for efficient problem-solving in software development."
    },
    {
      "Id": 4,
      "img": "https://i.ibb.co/6RpVNZj/Rectangle-3.png",
      "title": "Basic Data Structures",
      "credit": 3,
      "prices": 8,
      "description": "Essential elements like arrays, linked lists, and trees are fundamental for efficient data organization and manipulation in computer science. "
    },
    {
      "Id": 5,
      "img": "https://i.ibb.co/VtLL7Nt/Rectangle-2.png",
      "title": "Introduction to OOP Python",
      "credit": 2,
      "prices": 20,
      "description": "Explore the principles of Object-Oriented Programming in Python, a powerful paradigm for organizing and structuring code efficiently."
    },
    {
      "Id": 6,
      "img": "https://i.ibb.co/g7n2nGY/Rectangle-2-5.png",
      "title": "Software Engineering",
      "credit": 5,
      "prices": 14,
      "description": "The systematic and disciplined approach to designing, building, testing, and maintaining software systems, ensuring reliability and quality in development."
    },
    {
      "Id": 7,
      "img": "https://i.ibb.co/XxYYgRz/Rectangle-3-1.png",
      "title": "AWS, Cloud Computing",
      "credit": 18,
      "prices": 30,
      "description": "Amazon Web Services (AWS) delivers cloud-based solutions, empowering organizations with scalable, cost-effective, and flexible computing resources for various applications."
    },
    {
      "Id": 8,
      "img": "https://i.ibb.co/gyt1WSg/Rectangle-2-1.png",  
      "title": "Database (MySQL)",
      "credit": 7,
      "prices": 10,
      "description": "MySQL is a popular open-source relational database management system. It is known for its speed, reliability, scalability, and is widely used in web and application development."
    },
    {
      "Id": 9,
      "img": "https://i.ibb.co/yFJN4tG/Rectangle-2-6.png",
      "title": "Problem-Solving Part",
      "credit": 10,
      "prices": 18,
      "description": "This section focuses on developing critical thinking and analytical skills, essential for effective troubleshooting and finding solutions to complex challenges in various domains."
    }
  ]
  